const quest = [
	[
		"Знайди предмет, який допомагає відраховувати час",
		[491, 492, 493, 494, 495, 535, 536, 537, 538, 539, 540, 541, 581, 582, 583, 584, 585, 586, 587, 627,628, 629, 630,631, 632, 633, 673, 674, 675, 676, 677, 678, 679, 719, 720, 721, 722, 723, 724,725, 765, 766, 767, 768, 769, 770, 771, 811, 812, 813, 814, 815, 816, 817, 857, 858, 859, 860, 861, 862, 863, 903, 904, 905, 906, 907, 908, 950, 951, 952, 953, 270, 271, 272, 273, 315, 316, 317, 318, 319, 320, 321, 360, 361, 362, 363, 364, 365, 366, 367, 368, 406, 407, 408, 409, 410, 411, 412, 413, 414, 452, 453, 454, 455, 456, 457, 458, 459, 460, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 727, 728, 729, 730, 731, 732, 733, 734, 735, 773, 774, 775, 778, 779, 780, 820, 821, 822, 823, 824, 825, 826, 868, 869, 870, 871],
		"Правильно! Це годиннкик!"
	],
    
	[
		"На цьому предметі зображена наша планета. Що це?",
		[1725, 1726, 1727, 1770, 1771, 1772, 1773, 1774, 1815, 1816, 1817, 1818, 1819, 1820, 1861, 1862, 1863, 1864, 1865, 1866, 1907, 1908, 1909, 1910, 1911, 1912, 1953, 1954, 1955, 1956, 1957, 1958, 2000, 2001, 2002, 2003, 2004, 2046, 2047, 2048, 2049, 2050],
		"Правильно! Це глобус!"
	],

    [
		"Знайди предмет круглої форми, схожий на планету, але це не глобус. Що це?",
		[1808, 1809, 1810, 1853, 1854, 1855, 1856, 1857, 1899, 1900, 1901, 1902, 1903, 1945, 1946, 1947, 1948, 1949, 1991, 1992, 1993, 1994, 1995, 2037, 2038, 2039, 2040, 2041
        ],
		"Правильно! Це старовинний астролябій!"
	],
	[
		"Ця річ тримає в собі спогади. Що це?",
		[839, 840, 841, 885, 886, 887, 931, 932, 933, 934, 935, 977, 978, 979, 980, 981, 1069, 1070, 1071, 1115, 1116, 1117, 1161, 1162, 1163, 1207, 1208, 1209],
		"Правильно! Це фото!"
	],
	[
		"Предмет, який створює світло в темноті?",
		[ 658, 659, 660, 661, 704, 705, 706, 707, 750, 751, 752, 753, 796, 797, 798, 799, 817, 818, 819, 863, 864, 910, 956, 957, 842, 843, 844, 845, 888, 889, 890, 891, 1073, 1074, 1118, 1119, 1120, 1164, 1165, 1166, 1167, 1211, 1212, 1257, 1258, 1342, 1388, 1389, 1433, 1434, 1435, 1480, 1481, 1526, 1527
        ],
		"Правильно! Це лампа!"
	],
	[
		"Предмет, який переносить з однієї кімнати в іншу?",
		[1087, 1088, 1089, 1090, 1091, 1092, 1093, 1133, 1134, 1135, 1136, 1137, 1138, 1139, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1271, 1272, 1273, 1274, 1275, 1276, 1277, 1317, 1318, 1319, 1320, 1321, 1322, 1323, 1363, 1364, 1365, 1366, 1367, 1368, 1369, 1408, 1409, 1410, 1411, 1412, 1413, 1414, 1415, 1454, 1455, 1456, 1457, 1458, 1459, 1460, 1461, 1500, 1501, 1502, 1503, 1504, 1505, 1506, 1507, 1546, 1547, 1548, 1549, 1550, 1551, 1552, 1553, 1592, 1593, 1594, 1595, 1596, 1597, 1598, 1599, 1638, 1639, 1640, 1641, 1642, 1643, 1644, 1645, 1684, 1685, 1686, 1687, 1688, 1689, 1691, 1730, 1731, 1732, 1733, 1734, 1735, 1736, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783, 1822, 1823, 1824, 1825, 1826, 1827, 1828, 1868, 1869, 1870, 1871, 1872, 1873, 1874, 1914, 1915, 1916, 1917, 1918, 1919, 1920, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2052, 2053, 2054, 2055, 2056, 2057, 2058],
		"Правильно! У двері!"
	]

]

quest.sort(() => Math.random() - 0.5)

let number = 0
let flag = false
const boxes = document.querySelectorAll(".box")
const question = document.querySelector(".question")
const info = document.querySelector(".info")
const buttonOk = document.querySelector(".button-ok")
const text = document.querySelector(".text")

question.addEventListener("click", showQuestion)
buttonOk.addEventListener("click", hideQuestion)

for (let i = 0; i < boxes.length; i++) {
	boxes[i].addEventListener("click", check)
}

function check() {
	if (quest[number][1].some(item => item == this.textContent)) {
		info.style.display = "flex"
		text.textContent = quest[number][2]
		flag = true
	}
	else {
		info.style.display = "flex"
		text.textContent = "На жаль, НІ! Шукайте далі..."
	}
}
function showQuestion() {
	info.style.display = "flex"
	text.textContent = quest[number][0]
}
function hideQuestion() {
	info.style.display = "none"
	if (flag){
		number++
		flag = false
	}
	if (number == quest.length){
		info.style.display = "flex"
		text.textContent = "Ви пройшли всі питання та перемогли! ВІТАЄМО!"
		setTimeout(
			function(){
			window.location.reload()
			}, 5000
		)
	}
}